---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.ActualRiserHeightChanged
source: html/5bfdd63e-7f73-b15a-bab9-57f6f3ca6064.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.ActualRiserHeightChanged Property

The actual riser height for one or more stairs violates the maximum set in the type.

## Syntax (C#)
```csharp
public static FailureDefinitionId ActualRiserHeightChanged { get; }
```